nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/common/pin_mux/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);          /* Function assigned for the Cortex-M7F */

#define BOARD_INITDEBUG_UARTPINS_DEINIT_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x0180U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitDEBUG_UARTPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitDEBUG_UARTPins_deinit(void);   /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B2_09 (coord C15), ENET_QOS_RXER */
/* Routed pin properties */
#define BOARD_INITSAIPINS_ENET_QOS_RXER_PERIPHERAL                          SAI1   /*!< Peripheral name */
#define BOARD_INITSAIPINS_ENET_QOS_RXER_SIGNAL                       sai_tx_sync   /*!< Signal name */

/* GPIO_DISP_B2_06 (coord A11), ENET_QOS_RXD0 */
/* Routed pin properties */
#define BOARD_INITSAIPINS_ENET_QOS_RXD0_PERIPHERAL                          SAI1   /*!< Peripheral name */
#define BOARD_INITSAIPINS_ENET_QOS_RXD0_SIGNAL                     sai_rx_data00   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSAIPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENCPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_00 (coord L19), ETH0_RX_EN */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_RX_EN_PERIPHERAL                      ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_RX_EN_SIGNAL                       enet_rx_en   /*!< Signal name */

/* GPIO_SD_B2_01 (coord J25), ETH0_RX_CLK */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_RX_CLK_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_RX_CLK_SIGNAL                     enet_rx_clk   /*!< Signal name */

/* GPIO_SD_B2_02 (coord M24), ETH0_RDATA0 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_RDATA0_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA0_SIGNAL                      enet_rdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA0_CHANNEL                             0U   /*!< Signal channel */

/* GPIO_SD_B2_03 (coord J18), ETH0_RDATA1 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_RDATA1_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA1_SIGNAL                      enet_rdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA1_CHANNEL                             1U   /*!< Signal channel */

/* GPIO_SD_B2_04 (coord L23), ETH0_RDATA2 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_RDATA2_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA2_SIGNAL                      enet_rdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA2_CHANNEL                             2U   /*!< Signal channel */

/* GPIO_EMC_B2_07 (coord W6), ETH0_RDATA3 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_RDATA3_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA3_SIGNAL                      enet_rdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_RDATA3_CHANNEL                             3U   /*!< Signal channel */

/* GPIO_DISP_B1_06 (coord F16), ETH0_TDATA3 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_TDATA3_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA3_SIGNAL                      enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA3_CHANNEL                             3U   /*!< Signal channel */

/* GPIO_DISP_B1_07 (coord H16), ETH0_TDATA2 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_TDATA2_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA2_SIGNAL                      enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA2_CHANNEL                             2U   /*!< Signal channel */

/* GPIO_DISP_B1_08 (coord B22), ETH0_TDATA1 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_TDATA1_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA1_SIGNAL                      enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA1_CHANNEL                             1U   /*!< Signal channel */

