nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/common/pin_mux/pin_mux.h
/* GPIO_DISP_B1_09 (coord C21), ETH0_TDATA0 */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_TDATA0_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA0_SIGNAL                      enet_tdata   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_TDATA0_CHANNEL                             0U   /*!< Signal channel */

/* GPIO_DISP_B1_10 (coord A23), ETH0_TX_EN */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_TX_EN_PERIPHERAL                      ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_TX_EN_SIGNAL                       enet_tx_en   /*!< Signal name */

/* GPIO_DISP_B1_11 (coord G16), ETH0_TX_CLK */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_TX_CLK_PERIPHERAL                     ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_TX_CLK_SIGNAL                  enet_tx_clk_io   /*!< Signal name */

/* GPIO_EMC_B1_41 (coord R3), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_MDIO_PERIPHERAL                       ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_MDIO_SIGNAL                         enet_mdio   /*!< Signal name */

/* GPIO_EMC_B1_40 (coord R1), ENET_MDC */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ENET_MDC_PERIPHERAL                        ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ENET_MDC_SIGNAL                           enet_mdc   /*!< Signal name */

/* GPIO_AD_14 (coord T20), ETH0_INT_B */
/* Routed pin properties */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_PERIPHERAL                        GPIO9   /*!< Peripheral name */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_CHANNEL                             13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_GPIO                              GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_GPIO_PIN                            13U   /*!< GPIO pin number */
#define BOARD_INITENET_1GPINS_ETH0_INT_B_GPIO_PIN_MASK               (1U << 13U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET_1GPins(void);             /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_41 (coord R3), ENET_MDIO */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_MDIO_PERIPHERAL                      ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_MDIO_SIGNAL                        enet_mdio   /*!< Signal name */

/* GPIO_EMC_B1_40 (coord R1), ENET_MDC */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_MDC_PERIPHERAL                       ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_MDC_SIGNAL                          enet_mdc   /*!< Signal name */

/* GPIO_DISP_B2_04 (coord G11), ENET_QOS_TXEN */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXEN_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXEN_SIGNAL                   enet_tx_en   /*!< Signal name */

/* GPIO_EMC_B2_20 (number AE5), ENET_QOS_REF_CLK1 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_REF_CLK1_PERIPHERAL             ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_REF_CLK1_SIGNAL             enet_ref_clk   /*!< Signal name */

/* GPIO_DISP_B2_02 (coord B14), ENET_QOS_TXD0 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD0_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD0_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B2_03 (coord H11), ENET_QOS_TXD1 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD1_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD1_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_TXD1_CHANNEL                          1U   /*!< Signal channel */

/* GPIO_DISP_B2_08 (coord C11), ENET_QOS_CRS_DV */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_CRS_DV_PERIPHERAL               ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_CRS_DV_SIGNAL                 enet_rx_en   /*!< Signal name */

/* GPIO_DISP_B2_06 (coord A11), ENET_QOS_RXD0 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD0_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD0_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD0_CHANNEL                          0U   /*!< Signal channel */

/* GPIO_DISP_B2_07 (coord C9), ENET_QOS_RXD1 */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD1_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD1_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXD1_CHANNEL                          1U   /*!< Signal channel */

/* GPIO_DISP_B2_09 (coord C15), ENET_QOS_RXER */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXER_PERIPHERAL                 ENET_QOS   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_RXER_SIGNAL                   enet_rx_er   /*!< Signal name */

/* GPIO_DISP_B2_11 (coord C13), ENET_QOS_INT_B */
/* Routed pin properties */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_PERIPHERAL                  GPIO11   /*!< Peripheral name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_CHANNEL                        12U   /*!< Signal channel */

