nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_GPIO                        GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_GPIO_PIN                       12U   /*!< GPIO pin number */
#define BOARD_INITENET_QOSPINS_ENET_QOS_INT_B_GPIO_PIN_MASK          (1U << 12U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET_QOSPins(void);            /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_I2CPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_I2SPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_PWMPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_SPIPins(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLEXIO_UARTPins(void);         /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIPins(void);                 /* Function assigned for the Cortex-M7F */

#define BOARD_INITSPIPINS_DEINIT_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x7800U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitSPIPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitSPIPins_deinit(void);          /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGPTPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitKPPPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2CPins(void);                 /* Function assigned for the Cortex-M7F */

#define BOARD_INITI2CPINS_DEINIT_IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK 0x0180U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief This is a de-initialization function for 'BOARD_InitI2CPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitI2CPins_deinit(void);          /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_05 (coord L20), DQS */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_DQS_PERIPHERAL                              FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_DQS_SIGNAL                             FLEXSPI_A_DQS   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLASHPins(void);               /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitALT_UARTPins(void);            /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWMPins(void);                 /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQTMRPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_39 (coord N3), LED */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_PERIPHERAL                                  GPIO8   /*!< Peripheral name */
#define BOARD_INITLEDSPINS_LED_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITLEDSPINS_LED_CHANNEL                                        7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_GPIO                                        GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_INIT_GPIO_VALUE                                0U   /*!< GPIO output initial state */
#define BOARD_INITLEDSPINS_LED_GPIO_PIN                                       7U   /*!< GPIO pin number */
#define BOARD_INITLEDSPINS_LED_GPIO_PIN_MASK                          (1U << 7U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);                /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void);             /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCLOCKOUTPins(void);            /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void);                /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDCICPins(void);                /* Function assigned for the Cortex-M7F */

#define BOARD_INITFAST_GPIOPINS_IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK 0x18U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFAST_GPIOPins(void);           /* Function assigned for the Cortex-M7F */

#define BOARD_INIT6524PINS_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x0400U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init6524Pins(void);                /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCODEC_I2CPins(void);           /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitALT_I2CPins(void);             /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
